## Terraform checks in directory ''
#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`
[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "azurerm"! Terraform will automatically
use this backend unless the backend configuration changes.[0m

[0m[1mInitializing provider plugins...[0m
- Finding latest version of hashicorp/azurerm...
- Installing hashicorp/azurerm v3.89.0...
- Installed hashicorp/azurerm v3.89.0 (signed by HashiCorp)

Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32m
You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.[0m
`
#### Terraform Plan 📖`Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wMTFmZjJiZC02MTczLTQwMmEtYTJiZC04MGRkZDUxN2VlMDg7b2JqZWN0SWQ9ZWRjMDdmMGEtMmY2Ni00OTE3LWFhYzEtMzZiNDcxMzJjMjdiO3N1YnNjcmlwdGlvbklkPTRkNTVjOTE0LTcyNmItNGEwMy1iMDAyLTU0YzRiZjIxN2FkNTt0ZW5hbnRJZD05NzgxYWIwOC1lZjdkLTRlNGYtYjZmMC1jNTk1YjdhMDIzY2I=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_network_security_group.nsg[0] will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "japanwest"
      + name                = "nsg0"
      + resource_group_name = "rg-example"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = "Allow RDP"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "3389"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "AllowRDP"
              + priority                                   = 1000
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "219.166.164.110"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "japanwest"
      + name     = "rg-example"
    }

  # azurerm_subnet.subnet[0] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "192.168.0.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "subnet0"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-example"
      + virtual_network_name                           = "vnet"
    }

  # azurerm_subnet_network_security_group_association.subnet_nsg_association[0] will be created
  + resource "azurerm_subnet_network_security_group_association" "subnet_nsg_association" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "192.168.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "japanwest"
      + name                = "vnet"
      + resource_group_name = "rg-example"
      + subnet              = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: sample.main.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "sample.main.tfplan"
Releasing state lock. This may take a few moments...
`